man4781747/Akira_FOC__STM32F103/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/**
 * 待研究閱讀:
 *  - 不同 Timer 同步: https://shequ.stmicroelectronics.cn/thread-622883-1-1.html
 *  - PWM觸發ADC轉換並經由DMA搬運 : https://ithelp.ithome.com.tw/articles/10282007
 *  - DMA控制I2C : https://blog.csdn.net/KASIXA/article/details/136001090
 *  - USB 2.0 使用 : https://blog.csdn.net/qq_36347513/article/details/127404464
*   - PWM觸發ADC轉換並經由DMA搬運 : https://blog.51cto.com/u_16213585/12185463
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdint.h>
#include <stdio.h> // for printf
#include "setting.h"
#include "driver.h"
#include "M24C64_ctrl.h"
#include "sensor.h"
#include "micro_timer.h"
#include "lowpass_filter.h"
#include "PID_Ctrl.h"
#include "qfplib-m3.h"
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_tim.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CAN_HandleTypeDef hcan;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_CAN_Init(void);
static void MX_I2C2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM4_Init(void);
/* USER CODE BEGIN PFP */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define ADC_BUF_SIZE   2 // DMA 緩衝區大小 (單個通道的採樣點數)
#define ADC_BUF_SIZE_BUFFER 10 
uint16_t adc_dma_buffer[ADC_BUF_SIZE*ADC_BUF_SIZE_BUFFER];
uint16_t adc_bios = 0;

uint16_t adc_bios_W;
uint16_t adc_bios_U;
uint16_t adc_bios_V;

float angShift = 0;
float positon_Target = 0;

float Id_Target = 0;

LowPassFilter filter_U;
float current_U;
LowPassFilter filter_V;
float current_V;
LowPassFilter filter_W;
float current_W;
LowPassFilter filter_Speed;

float u_alpha, u_beta;
float I_alpha, I_beta;
float cosRad, sinRad;
float I_d, I_q;
float uq;
float ud = 0;
float ang_temp, angToRad;
float U1, U2, U3;

PIDController PID__current_Id;
PIDController PID__current_Iq;
PIDController PID__velocity;
PIDController PID__position;

uint16_t pwmPluse_1[1] = {0};
uint16_t pwmPluse_2[1] = {0};
uint16_t pwmPluse_3[1] = {0};

// 定義傳輸標頭和數據
CAN_TxHeaderTypeDef TxHeader;
uint8_t TxData[8] = {};
uint32_t TxMailbox; // 用來儲存發送的郵箱號


int isSend = 1;

void I2C_Scan_Bus(void)
{
  uint8_t i;
  HAL_StatusTypeDef ret;
  // uint8_t StartMSG[] = "Starting I2C Scanning: \n";
  // HAL_UART_Transmit(&huart2, StartMSG, sizeof(StartMSG), 10000);
  printf("Scanning I2C bus...\n");
  for (i = 1; i < 128; i++) // 遍历所有可能的 7 位地址 (1 到 127)
  {
      // 尝试检查设备是否就绪。I2C地址需要左移1位，并设置为8位地址
      // TrialByte: 用于发送的虚拟字节，通常可以为1，或者不需要实际的写入数据
      // Timeout: 等待应答的超时时间
      ret = HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(i << 1), 3, 5);

      if (ret == HAL_OK)
      {
        printf("Found device at address 0x%02X\n",i);
      }
      else if (ret == HAL_ERROR)
      {
          // HAL_I2C_IsDeviceReady返回HAL_ERROR通常表示总线错误，需要检查硬件连接
          // 或I2C配置，但在扫描时，这可能是因为没有设备应答，所以通常不做特殊处理
      }
      else if (ret == HAL_BUSY)
      {
          // I2C总线忙，可以等待或重试
      }
      else if (ret == HAL_TIMEOUT)
      {
          // 超时，表示没有设备应答
      }
  }
  // uint8_t EndMSG[] = "Done! \n";
  // HAL_UART_Transmit(&huart2, EndMSG, sizeof(EndMSG), 10000);
  printf("I2C scan complete.\n");
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_CAN_Init();
  MX_I2C2_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  MX_TIM4_Init();
  /* USER CODE BEGIN 2 */

  // 時鐘計時設定
  init_micros_timer();

  // M24C64
  uint8_t M24C64_Data[100];
  uint8_t WriteDataTest[100];
  // HAL_I2C_Mem_Write 函數會處理 START, 從設備位址, 記憶體位址, 資料, STOP, ACK/NACK
  for (int i =0;i<100;i++){
    WriteDataTest[i] = i;
    M24C64_Data[i] = 0;
  }
  M24C64_WriteData(WriteDataTest, 0, 32);
  M24C64_WriteData(WriteDataTest+32, 1, 32);
  M24C64_ReadData(M24C64_Data, 0, 32);
  M24C64_ReadData(M24C64_Data+32, 1, 32);

  float test_ = 0.000095f;
  LowPassFilter_Init(&filter_U, test_);
  LowPassFilter_Init(&filter_V, test_);
  LowPassFilter_Init(&filter_W, test_);
  LowPassFilter_Init(&filter_Speed, 0.008f);

  /**
   * https://www.bilibili.com/video/BV1VT421k782/?spm_id_from=333.337.search-card.all.click&vd_source=43115a2a3d33edfb64a16bbcb1b2fda3
   * R = 5.1
   * L = 0.0028
   * Kp = 0.0028(L)*350*2*pi = 6.157521601035994
   * Ki = 5.1*350*2*pi/10000 = 1.121548577331556
   */

  // PIDController_init(&PID__current_Id, 6.157521601035994, 1.121548577331556, 0, 0, 4.5);
  // PIDController_init(&PID__current_Iq, 6.157521601035994, 1.121548577331556, 0, 0, 4.5);  

  /**
   * 
   * 
   */
  float test = 5 ; // 6.3  /// 50
  PIDController_init(&PID__current_Id, 4.6, 1475, 0, 0, 4.5);  
  PIDController_init(&PID__current_Iq, 4.6, 1475, 0, 0, 4.5);  

   
  // PIDController_init(&PID__current_Id, test, test*55, 0.00012, 0, 4.5);
  // PIDController_init(&PID__current_Id, 4, 4*240, 0, 0, 4.5);
  // PIDController_init(&PID__current_Iq, 4, 4*240, 0, 0, 4.5);  
  // PIDController_init(&PID__velocity, 0.15, 0.515, 0, 0, 1);




  PIDController_init(&PID__velocity, 0.048 , 0.0925 , 0., 0, .7);
  PIDController_init(&PID__position,0.0685, 0, 0.000, 0, 3);

  // adc設定
  // https://blog.csdn.net/tangxianyu/article/details/121149981
  // HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buffer, ADC_BUF_SIZE);



