man4781747/Akira_FOC__STM32F103/Core/Src/main.c
  // https://blog.csdn.net/qq_45854134/article/details/134181326
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);    
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, htim1.Init.Period);
  // __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 225);
  __HAL_TIM_SET_COUNTER(&htim1, 0);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1); 
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

  // HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_1, (uint32_t*)&pwmPluse_1, 1); 
  // HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_2, (uint32_t*)&pwmPluse_2, 1);
  // HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_3, (uint32_t*)&pwmPluse_3, 1);

  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1); 
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

  HAL_TIM_OC_Start_IT(&htim1, TIM_CHANNEL_4);

  HAL_TIM_Base_Start(&htim4); 
  // HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buffer, ADC_BUF_SIZE);
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);

  GPIO_InitTypeDef GPIO_InitStruct = {0}; // 1-V/A
  GPIO_InitStruct.Pin = GAIN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG; // 設定為類比模式 (高阻態)
  GPIO_InitStruct.Pull = GPIO_NOPULL;      // 不啟用內部上下拉電阻 (通常類比模式不需要)
  HAL_GPIO_Init(GAIN_GPIO_Port, &GPIO_InitStruct);

  HAL_GPIO_WritePin(SLEW_GPIO_Port, SLEW_Pin, GPIO_PIN_SET);   // 200-V/µ
  HAL_GPIO_WritePin(PWM_ACTIVE_GPIO_Port, PWM_ACTIVE_Pin, GPIO_PIN_RESET);

  HAL_GPIO_WritePin(SLEEP_GPIO_Port, SLEEP_Pin, GPIO_PIN_RESET);
  HAL_Delay(10);
  HAL_GPIO_WritePin(SLEEP_GPIO_Port, SLEEP_Pin, GPIO_PIN_SET);
  HAL_Delay(10);
  adc_bios_W = adc_dma_buffer[0];
  adc_bios_U = adc_dma_buffer[1];
  printf("ADC Bios: %d, %d\n", adc_bios_W, adc_bios_U);
  HAL_GPIO_WritePin(PWM_ACTIVE_GPIO_Port, PWM_ACTIVE_Pin, GPIO_PIN_SET);
  SetAng(0);
  
  HAL_Delay(500);
  angShift = readAng(angShift);

  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);

  int logCount = 0;
  float test123 = 1;
  float speed__Target = 0;
  float u_q__Target = 0.1;
  uint64_t old_ang_time = micros();
  uint64_t new_ang_time;
  float ang_get = readAng(angShift);
  float d_ang;
  float ang_speed = 0;
  float ang_Target = 90;

  // 啟動CAN週邊
  HAL_CAN_Start(&hcan);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    new_ang_time = micros();
    ang_temp = readAng(angShift);
    d_ang = ang_temp - ang_get;
    if (d_ang > 180) {
      d_ang -= 360;
    } else if (d_ang < -180) {
      d_ang += 360;
    }
    int dTime = (int)new_ang_time-(int)old_ang_time;
    if (dTime < 0) {
      dTime += 65535;
    }
      
    ang_speed = LowPassFilter_Update(&filter_Speed, d_ang/dTime*2777.777777777778f);
    // ang_speed = d_ang/dTime*2777.777777777778f;
    
    ang_get = ang_temp;
    old_ang_time = new_ang_time;
    // angToRad = ang_temp*7*0.01745329251f;
    angToRad = qfp_fmul(qfp_fmul(ang_temp, 7), 0.01745329251f);

    uint16_t W_add = 0;
    uint16_t U_add = 0;
    for (int i = 0; i < ADC_BUF_SIZE_BUFFER; i++) {
      W_add += adc_dma_buffer[2*i];
      U_add += adc_dma_buffer[2*i+1];
    }
    W_add /= ADC_BUF_SIZE_BUFFER;
    U_add /= ADC_BUF_SIZE_BUFFER;

    current_W = qfp_fmul(W_add-adc_bios_W, 0.0008056640625f);
    current_U = qfp_fmul(U_add-adc_bios_U, 0.0008056640625f);
    current_V = qfp_fsub(-current_U, current_W);
    // current_W = LowPassFilter_Update(&filter_W, (float)(W_add-adc_bios_W)*0.0008056640625f);
    // current_U = LowPassFilter_Update(&filter_U, (float)(U_add-adc_bios_U)*0.0008056640625f);
    // current_V = LowPassFilter_Update(&filter_V, -current_U - current_W);



    I_alpha = current_V;
    I_beta = qfp_fmul(
      qfp_fadd(
        qfp_fmul(current_U,2), 
        current_V
      ),_1_SQRT3
    );
    // I_beta = qfp_fadd(current_U*2, current_V);

    cosRad = qfp_fcos(angToRad);
    sinRad = qfp_fsin(angToRad);
    // cosRad = cos(angToRad);
    // sinRad = sin(angToRad);

    I_d = qfp_fadd( qfp_fmul(I_alpha, cosRad), qfp_fmul(I_beta, sinRad));
    I_q = qfp_fsub( qfp_fmul(I_beta, cosRad), qfp_fmul(I_alpha, sinRad));
    // I_d = I_alpha*cosRad + I_beta*sinRad;
    // I_q = -I_alpha*sinRad + I_beta*cosRad;
    
    float d_ang = positon_Target - ang_temp;
    if (d_ang > 180) {
      d_ang = 360 - d_ang;
    } else if (d_ang < -180) {

      d_ang += 360;
    }

    if (logCount++ > 500) {
      // printf("%.2f,%.4f,%.4f,%.4f,%.4f,%.4f,%.2f, %.2f, %.2f\n", 
      //   ang_temp,I_q, I_d,current_W, current_U, current_V, ang_speed, U2, U3
      // );
      // positon_Target += 30;
      // if (positon_Target >= 360) {
      //   positon_Target -= 360;
      // }
      logCount = 0;
      // speed__Target += test123;
      // if (speed__Target > 10 || speed__Target < -10) {
      //   speed__Target = -speed__Target;
      // }
      // if (speed__Target > 4 || speed__Target < -4) {
      //   test123 = -test123;
      // }
      // u_q__Target += 0.1;
      // if (ang_Target == 90) {
      //   ang_Target = 270;
      // } else {
      //   ang_Target = 90;
      // }
    } 



    speed__Target = PIDController_process(&PID__position, ang_Target-ang_temp);
    speed__Target = 10;

    u_q__Target = PIDController_process(&PID__velocity, speed__Target-ang_speed);
    // u_q__Target = 0.1;

    // uq = 0;
    uq = PIDController_process(&PID__current_Iq, u_q__Target - I_q);

    // ud = 0;
    // Id_Target = 0;
    ud = PIDController_process(&PID__current_Id, -I_d);
    // ud = 0;
    u_alpha = qfp_fsub( qfp_fmul(ud, cosRad), qfp_fmul(uq, sinRad));
    u_beta = qfp_fadd( qfp_fmul(ud, sinRad), qfp_fmul(uq, cosRad));
    // u_alpha = ud*cosRad-uq*sinRad;
    // u_beta = ud*sinRad+uq*cosRad;


    // speed__Target = 0.5;
    Svpwm(u_alpha, u_beta);
    printf("%.2f,%.2f,%.4f,%.4f,%.4f,%.4f,%.4f,%.2f, %.2f, %.2f\n", 
      ang_temp,speed__Target,I_q, I_d,current_W, current_U, current_V, ang_speed, Id_Target, u_q__Target

