man4781747/Akira_FOC__STM32F103/Core/Src/main.c
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  /* DMA1_Channel4_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, SLEEP_Pin|SLEW_Pin|GAIN_Pin|PWM_ACTIVE_Pin
                          |LED_Status_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(EEPROM_RW__GPIO_Port, EEPROM_RW__Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : nFAULT_Pin */
  GPIO_InitStruct.Pin = nFAULT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(nFAULT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SLEEP_Pin SLEW_Pin GAIN_Pin PWM_ACTIVE_Pin
                           LED_Status_Pin */
  GPIO_InitStruct.Pin = SLEEP_Pin|SLEW_Pin|GAIN_Pin|PWM_ACTIVE_Pin
                          |LED_Status_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : EEPROM_RW__Pin */
  GPIO_InitStruct.Pin = EEPROM_RW__Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EEPROM_RW__GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
int _write(int file, char *ptr, int len)
{
    // 透過 UART1 將數據發送出去
    // huart1 是由 CubeMX 生成的 UART1 句柄
    // HAL_MAX_DELAY 表示阻塞式發送，直到發送完成
    // HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, HAL_MAX_DELAY);
    // HAL_UART_Transmit_IT(&huart1, (uint8_t*)ptr, len);
    HAL_UART_Transmit_DMA(&huart1, (uint8_t*)ptr, len);
    return len;
}

void TIM1_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&htim1);
}

// void TIM4_IRQHandler(void)
// {
//   HAL_TIM_IRQHandler(&htim4);
// }

void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
  if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4) // 檢查是否是 TIM1 的 Channel 4 觸發
  {
    /**
     * @brief 有感流程需要量測ADC
     * 
     */
    HAL_ADC_Start_DMA(&hadc1, (uint32_t*)(adc_dma_buffer+adc_bios*2), ADC_BUF_SIZE);
    adc_bios ++;
    if (adc_bios >= ADC_BUF_SIZE_BUFFER) {
      adc_bios = 0;
    }

    


  }
}

// DMA 傳輸完成回呼函數 (Full Transfer Complete)
// void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
// {
//     if (hadc->Instance == ADC1) // 檢查是否是 ADC1 的 DMA 觸發
//     {
//       ang_temp = readAng(angShift);
//       angToRad = qfp_fmul(qfp_fmul(ang_temp, 7), 0.01745329251f);
//       // current_W = qfp_fmul(adc_dma_buffer[0]-adc_bios_W, 0.0008056640625f);
//       // current_U = qfp_fmul(adc_dma_buffer[1]-adc_bios_U, 0.0008056640625f);
//       // current_V = qfp_fsub(-current_U, current_W);
//       // I_alpha = current_V;
//       // I_beta = qfp_fmul(
//       //   qfp_fadd(
//       //     qfp_fmul(current_U,2), 
//       //     current_V
//       //   ),_1_SQRT3
//       // );
//       // cosRad = qfp_fcos(angToRad);
//       // sinRad = qfp_fsin(angToRad);
//       // I_d = qfp_fadd( qfp_fmul(I_alpha, cosRad), qfp_fmul(I_beta, sinRad));
//       // I_q = qfp_fsub( qfp_fmul(I_beta, cosRad), qfp_fmul(-I_alpha, sinRad));
//       uq = 1;
//       ud = 0;
//       u_alpha = qfp_fsub( qfp_fmul(ud, cosRad), qfp_fmul(uq, sinRad));
//       u_beta = qfp_fadd( qfp_fmul(ud, sinRad), qfp_fmul(uq, cosRad));
//       // Svpwm(u_alpha, u_beta);
//       float U1, U2, U3;
//       float center = 5.f;
//       U1 = u_alpha;
//       U2 = qfp_fsub(qfp_fmul(_SQRT3_2, u_beta),qfp_fmul(u_alpha, 0.5f));
//       U3 = qfp_fsub(qfp_fmul(-_SQRT3_2, u_beta),qfp_fmul(u_alpha, 0.5f));
//       float Umin = fmin(U1, fmin(U2, U3));
//       float Umax = fmax(U1, fmax(U2, U3));
//       center = qfp_fsub(center,qfp_fmul(qfp_fadd(Umax, Umin), 0.5f));
//       center -= (Umax+Umin) / 2;

//       U1 = qfp_fadd(U1, center);
//       // U1 += center;
//       U2 = qfp_fadd(U2, center);
//       // U2 += center;
//       U3 = qfp_fadd(U3, center);
//       // U3 += center;
//       U1 = qfp_fdiv(U1, 10);
//       // U1 /= 10;
//       U2 = qfp_fdiv(U2, 10);
//       // U2 /= 10;
//       U3 = qfp_fdiv(U3, 10);
//       if (U1>1) {U1=1.;}
//       else if (U1<0) {U1=0.;}
//       if (U2>1) {U2=1.;}
//       else if (U2<0) {U2=0.;}
//       if (U3>1) {U3=1.;}
//       else if (U3<0) {U3=0.;}


//     }
// }
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
